tutorials/multiphase/icoReactingMultiphaseInterFoam/mixerVesselAMI2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas       0
    volScalarFieldValue alpha.liquid    0
    volScalarFieldValue alpha.oil       0
    volScalarFieldValue alpha.mercury   0
    volScalarFieldValue T               300
);

regions
(
    boxToCell
    {
        box (0 0 -1) (1 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.liquid    1
            volScalarFieldValue T               374
        );
    }

    boxToCell
    {
        box (-1 0 -1) (0 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.oil       1
        );
    }

    boxToCell
    {
        box (-1 -1 -1) (0 0 1);
        fieldValues
        (
            volScalarFieldValue alpha.mercury   1
        );
    }

    boxToCell
    {
        box (0 -1 -1) (1 0 1);
        fieldValues
        (
            volScalarFieldValue alpha.gas       1
        );
    }
);


// ************************************************************************* //
